{
  "schedule": {
    "period": "0"
  },
  "displayName": "Domain Administrator Password Change",
  "detectionAction": {
    "organizationalScope": null,
    "responseActions": [],
    "alertTemplate": {
      "mitreTechniques": [
        "T1078.002"
      ],
      "description": ".",
      "category": "PrivilegeEscalation",
      "title": "Domain Administrator Password Change",
      "recommendedActions": null,
      "impactedAssets": [
        {
          "@odata.type": "#microsoft.graph.security.impactedDeviceAsset",
          "identifier": "deviceName"
        },
        {
          "@odata.type": "#microsoft.graph.security.impactedUserAsset",
          "identifier": "accountUpn"
        }
      ],
      "severity": "low"
    }
  },
  "isEnabled": true,
  "queryCondition": {
    "queryText": "IdentityDirectoryEvents\n| where ActionType == 'Account Password changed' \n| where AdditionalFields contains \"Domain Administrators\"\n| extend AccountUpn, Timestamp, ReportId"
  }
}
